app/views/game/play.html.erb

		<td><button id = 't1' class = 'tiles' type="button" onclick="myFunction(this.id)">
			<% t = Tile.find(1) %><%= t.tile_value%></button></td>
---
SELECT  "tiles".* FROM "tiles"  WHERE "tiles"."id" = ? LIMIT 1  [["id", 1]]