app/controllers/game_controller.rb

  def play
  	if id='t2'
  		t = Tile.find(2);
  		t.tile_value = 'd';
      t.save;
---
SELECT  "tiles".* FROM "tiles"  WHERE "tiles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tiles" SET "tile_value" = ?, "updated_at" = ? WHERE "tiles"."id" = 1  [["tile_value", "s"], ["updated_at", "2014-09-19 06:40:30.265498"]]