app/controllers/tiles_controller.rb

  def index
    @tiles = Tile.all
---
SELECT "tiles".* FROM "tiles"

  def create
    @tile = Tile.new(tile_params)

    respond_to do |format|
      if @tile.save
---
INSERT INTO "tiles" ("created_at", "tile_id", "tile_value", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-14 08:24:33.513926"], ["tile_id", "t1"], ["tile_value", ""], ["updated_at", "2014-09-14 08:24:33.513926"]]

    def set_tile
      @tile = Tile.find(params[:id])
---
SELECT  "tiles".* FROM "tiles"  WHERE "tiles"."id" = ? LIMIT 1  [["id", 1]]